$(document).ready(function() {
  // add elements here
});

class App { 
  
  constructor(message, username) {
    this.server = 'http://parse.atx.hackreactor.com/chatterbox/classes/messages';
    this.message = {
      username: 'Mel Brooks',
      text: 'It\'s good to be the king',
      roomname: 'lobby'
    };
    this.username = "billy";
  }

  init() {
    return 'hello';
  }
  
  sendBadText() {
    var badUserName = "<div id=\"zalgo4\"><marquee>Ļ̶̛̜̱̮̮̣̜̃́́̏͊̿̐͂̂ọ̵̬͚̲͖̥̘̲̏̑͂́̿̊r͎̰̘̲̞̣̮̥͓͋̒̈̓͗̅͆͋̿ḙ̞̗̙̥̹͈̟̇̂̽͑͒͐͟m̶̢̢̨͚̼͔̼̬̙͒̄̏͗̍͆̓͒̕͟͡ i̴̫͖͍̥̟̺̋̓͗͠͝p̺̥̣̣͂̀̿̈́̆̃̕͜s̸̠̤͔͖̥̊̽̐̑̿͘͡ư̹͇̘̰̖̹͈̩̘͇̆̏̑̚̕͞͝m̯̫̪̫͙̤̬͎̍̔͆̐̒̐̏͜͢͝ d̨̛͉̪͎͇̘͍̩̓̾͒͒̄̐͢ơ̵̡̟̱̤͕̠̤̭̑͐͑̊̊̊͊͒͜l̨͕̪̝͈̠̥̤̼͚̒͆͌̂̔ò̡͎̙̹̮̝̖̮̲͓̿̾̈́̏̈͡r̷̨̨̼̳̉̾͛̊̑͢͡ s̸̝̹̲͔̳̑̓́̍̄̇͝ĭ̴͓̜̞̬͍̭͎̐͂̑̓͑͟t̘̘͚̮̬̟̝̟̫̿̃̈́͗͌͆͘͝͡ a̴̧̛͇̥͚̬̖̳̙̰̱̓̄͋̈́̈́m̴̡̡̥̠͉̟͍͈̿̑̊̌̆̿̓̚e̶̳͍͇̬͎͆̋̋̍͡t̶̪̩͓̺̞́͂͐͑̑̐̒͘͟,̴̢̬̝͉̠̤͖͐́̏̑̌̽͑̓̚͠ c̶̘̳̖̲̼̱̒̆̍́͊̾͊̓̈́ó̤̥̲͖̼̟̩͑̂́͊̏̌n̰͇̬̲̙͇̺̬̉̏̀̏͋̇̀͡͠s̴̛͖̮̠̲̲͇̦͕͐̔̄̇̈́͒͂̌ë̸̲͉̗͙̦́͒̅́͂͂̋͟c̢͈͈̣͙̙̀͑̋́̕͢͜t̗͎̬͇͇̫̂͑́͑̃̀̍͝͝e̷̢̛͔͔̟͐̀͊̋͋͠͠͞ͅt̟̘͖̠͈͖̣̼̉͐̓͂́͝ų̢͉̺̳̭͈̼̉̋̐͂̈̚r̨̡̻͚͇̠͙̼̳̙̉̾̊̚͡ a̡̛̯̬͍̠͂̆̒̂̎̍͂͌d̨̨̼͍̘͇̦͙̼̳̑̿͂͛͗͘ĩ̵̢̛̻̪̱̫̟͖͈̟̑̑̓́͑̄̕p̷̨̛͈̮̯̺͙͎̈́̐̌͌͘͜͜͝͡͞i̶͉̟͇̙͑̍̾͘͜͞ͅś̷̛̤͕͔̞̯̥́̂͒̅̈́͝͠c̷̙̗̯̩̬̪̮̀͑͛͗͑͢ͅį̸̘͎̤̱͖̙̾̑̓̌͆̚͜n̛̙̮̤̫̦͇͕̄̓̾̾g̷̭̬̟͕͑̅̀̚͢͢͞ e̷̡̟̮͖͍͖̋̅̀͛̃͛ĺ̛͕̤̪̝̳̹̜͆̈́̍͘͝ͅǐ̸̲̼̟͔͇̮̠̂͐͘̕͜t̴̗͉̼̻̫̠̤̤̉͋̈́͗̀͒̏̄͢͠͝.̠̟̟̣̘̳̣̐́̾̒̓͑͊̓̓͘ C̨̛̲͍̻̯͙̻̲͌͌̆̒͂͝͡͠ȕ̸͎͖͖̜̺͐̚͡͞͠͡r̠̭̬̲͖͙̯̘͆̇̓̉͐̽̊̃̒͜͠a̯̩̼̤͓͗̂͋̀͂̾̉͋͟͡b̢̛̩͍̜̰̭͕́͗̈͊̋̄̔̃̿͜ͅį̵̝͚͖͙͔̺̋͛͐̅͗̑͂͒̕͢ţ̝̙̹͖̀̔̇̔̐͐̚̕͢ǔ̴̢̱̞͕̭̆͂̀͂̎̇r̶̞̜̹̙͍͛͌̀̈́͛͒͂̾͠͠ v̢̪̞͓̩͙͉͉̣̫́͆̏͋̏̆͊͝é̪̰̼̯̞̰͖͉̀̈̓̿̈̊̅n̹̫̠͖̣̩͛̔̇̍͐͂̃͋̉̆͜e̴̛̜͇̥͕͍̹͉̽̂̊̑̓̍̂̒̚͜ǹ̘̯̯̭̫̯̤̆͐͑̑͐́̂̚ͅͅa̷̭͍̬̥͖̻̽͐̉̆͠t̞̞̼͇̱͐̈́̓͋͊̓̿̕ĩ̡͙͍͉͔̼̣͆͂͘͜͢͠s̶̢̝̩̠̺̞͈͕̣̥̓́̌͊́̒́̑̐͝ n̵̡͚̦̗̠͎̪͉͎̩̊̆̈́̈̊̓̀̄õ̹̫̰̟͌̀͊͟͞͝n͙̙̯̫̦̗͐̾͆̉̓̂̏̋̆͢͜͡ o̼̝͔͇̪̭͕͂͊͑̉̈́͑̾̿̆͢d̸̨̤̥̪̹͈̘̟͚̍̋̃̆́̄̒̕͜į̸̧̱̘̻͍͇̗̿̄̔̅̄̾͌̕͘͢͠o̳͕͈̮̦̦͚̒̌̈͋͞ͅͅ u̡̧̮̳̱̜̣̰͈̓̑̌͘͜͡ṭ̢̲̮̰͕̪̗̻̑͂͒̔̈̔̕ͅ f̗͈̱̮͉̈́̎͌̀̀ă̢̡̼͖̟̜̬͓̮̼͋͑̓̆̎̿͌u̢̙̤͖̼͓̬͉͊̋̄͛͐͌̍̅͊͡ͅc̸͉̜̻͇̣̈́̎͋̍̽̽̇̉̚͞i̵̻̖̼̺̻̍͊̓̄͗̿̿̕͡͞b̩̘̭̟̬́̽̈́́͊̐͜ͅu̸̧̡̢̟̪̜̩̼͉̻̍̐̈́͌̓̈̅̐̕ş̨̛̮͍̜̲͍̼͈͍́͒͊̊͂͊̚.̛̰̞̙̇̌̂́̐́͟͜ S̛̤̲̺̖̥̟̦͕̰̽͑̇̚͢é̷͍̗̫̱̘̠̺̺͑̋́̄̓̇̔͘̚ͅḍ̶̨̯̣͇̥̠͐̏̔̓͆̇͘ í̷̡̖̹̞̰̥̄͒̽̓͐̚̚ͅḿ̡͔̤̬͎̼͒̆̿̈͋p̡̲͇̞̦̩̰̥̣̻̊͛̒̂̚ĕ̵͖͇̲̳̝̖͙̌̀̎̏r̸̢̝̺̭̥͎̗̖̈̈́̈̄͋͡d̴͍̙͖̤̹̦͐͒͐̈́͗̇͂͋̚͟ȉ̧̡͚̠̩͈̳̫̭̇̄̃͊͘̕e̫͓̖̖̱͛͂̾͊͊̈͊̕̕t̠͇̰̜͖̯̺̑͆̄̍͛̿͟͠ ù̗̘̜͇͖͆̅͑́l̶̨͙͕̟̦̻̹̲̇̏̋̓̚͜͜l̻̟̰̦̹͑̐̈͗̑̓͛̔̈͡a̶̻̖̙͓͖̯̞͕͋̄̅̈́̋̎̀̚ͅḿ̴͕̝̩̩̥̭̭̀̌͘͠͝ͅc͇͔̜̞̈́͆̆͒̎̄ͅȯ̡̡͎̞͍͈̱̤͗̆̐̚͘͜͜r̤̼̝͚͉̉̒̆̈́͊̕͜͜͢p̴͕͕̳̼̣̗̱̥̊́̄̊̎͛̾̽̉̍ȩ̷̘̺͍̺͙̩̪̿̉̇̈́̀͡͠r̶̡̙͓̫͎̅̊͂͊͘ͅͅ ẹ̴̢͎̞̙̤̦̅͋̉̿̕͘̚͟ṙ̡͖̳̯̦͎̒͝͡͠͡à̧̝̯̹̟̟͍̅̈́̏͑͘t̴̲̳̖̰̤͚̬́̌̈́̂̑͋̏̌̀͟,̛̘͎̫͈̙̼̲̤̈́̈̿̌̀̈́̄̚͠ é̷̡̡̝̞̲̓̾͐̊̾͢͢͢ͅu̢̡̮̻͓̞̟̐͋̓͊͘ r̶̨̝̦͇̻͎͖̙̍̇̀͐͌͜͡u̶̢̝͍͓̘̤̒͗͑̑̽̈́͆̕͜͝ͅt̛̪͚̟̞̰͍͊͑̽͜͢͞r̨̨̢͇̦͔̭͂̌̽̑̔ų̴̡̲̣̰̺̾̇͂̔̋͌m̡̛͇̰̮͓̻̪̮̟͒̐͗̏̎́̾͟͡͡ n̶̻͚͈͚̥̻̲̰̝͊͆͆͆̄̾͠i̡̯̘̥̣̖̓̉̐͆̎̓̒̉͞ͅb̨̨͎̳̹̭̠̺͋̾̚̚̚͟͢ḩ̬̪̭͓̱̲̤̔́̇̈͊͐̃͑͡͝ͅ m̧̛̞̬̹͓͈͍̰̽͊̅̀̆̌͝o̵̞̼̳̪̩͎̹̘͛̽͆̀̏̔͜͠ͅḽ̸̨̯̟̹̖̖͑̀̓̍͂è͎̠̺̹̹͈̀͆̾̂̇͞ͅŝ̷̢̟̭̬̗̥̽̍̅̇̆̽̚͜t̸͔͇͇̝̹͉̒̊̾͒̀̑̉̒͊̀ĭ̡͔͈̖̬̹̲̲̂̀̋̉͡ė̻̺̹̤̣̭̬̰̂̌̑̅̋͝ ą̛̙̬̫̗́͛͌̐̄̇͞c̵̨̹̪̺̘͈̝͔͖̹̍̀̆̕͝.̶̗̹͇̱̰̙̫̃̍̐͛͛̀̔̂͗̚ Ḓ̸̡̱̳̼̳̲̝͕͈͊͗̈́̊̑͠͞o̶̯̞̫̰͉͍̙̫̊̉͐̈̇͋́͑͆͢ͅń̛͖͉̬͔̬̮̱̻̪̉̿̈́̆ͅè̻͖̮͈̬̮͖͓̾͋̋͂̚c̙̬̻̹̯̞͎̭̝̱̉̊͐͞͝ ć̴̢̯͈̮̤̘̣̀̌͘͞ỏ̷͓̙̹̜̳̟̉̓̏͌̔̄͋͞͠n̢̫̯̙̣̹̠̅͋̍͛̾͞s̵͈̝̬͈̭̘̖̘̔̅͑͐̃͗̀̋͞͝e̷̢̛͉̫̠̫̞̿̍̔̑̈͝͡q̡̠͎̯̞̂̔̓͑̅̏͂̈̿u̜̗̖̟͙̱̝͈͈̇͗̃̏̈́̂͒͛̂͝a̵̘̲̯͈͙͗́̓́̓̌́̚̚t̘͔̤̣̝̺͆̊͊̇͂̓ ŗ̛͖͖̟̝͎͇̫̰̓̆͆͑͟u̷͈̪̤̱͉͊̓̅̋̍̏̚͞t̶̛̗͚͔͔͚̙̉̇́͌̏͜͟r̳̦͍̻̫̜̱͔̀̓͌͑̔u̖̮͖̺͚͛͂́̓̊̆̕m̨̩͉̩̱̦̣̺̞̗̊̅̓̉̀͌̊̔̇͝ m̵̬̺͓͖̟̮͈͋̀̋̍̎͜ę̻͓̤̼̟̖̞͂̂͛̊͒͜t̖̟͇̦̹̫̪̰͌͛̊͜͠͡ụ̴̼̟̙̥̖͇̠̋̐̆̚͘s̷̨͇̘͉̣͓̪̳̼̭̊̉̃͆̍ ȁ̡̛͚̟͍̲̗͎̯͈̽̆̄͗̇̈́͡c̵̢̯͈͖͈̺͈͖̤̎̓̆͋̎ ṥ̵̮̝͍͚̻̰̺͎͆̇͗̍̕͢͝e̬̙̝͇̪̻̅̎̌̔̐͌̄̂̚͠ͅm̧͚͔̬̤͖̞̖̭͌͋̊̋̊̂̓͢p̷̜̠͉̫͂̋̂̿́̄̀͜ͅȩ̤̯̝̲̀̽̈̍̉̏̏̚͡r̭̦̬̺̺̦̊́͒̒͌̄̄̆.̷̢̗̘̬̼̀͐͆̎̿͂͌̈͘ͅ M̵̧̟̦̠̦̭̟͚̖̲̾̋͋̐̐͋̀̏͘a̷̧͖̬̯̘̤͖͙̼̥̿͒͗̃͡ę̛̖͖̯̰̦̜̋̀̾̔̚͟͠ͅç̸͖̗̯̭̹̹̙͓͐̑̿̐́̑͢ē̴̡̧̡̗͕̟̮̭͎͈̿̄̾͐͗̽̓n̶̡̘̠̹̜̦̯͓̯͓̊́̅̎͛̉͡͡a̸̼̳͓̺̣̗̋͋̊̎̓̓͛́͂͡s̸̳̰̦̯̑͆̆͊̈̓͢ v̵̨̨͔͔̖͊̐̈͋̀́ͅa̼̣̩̹̳̼͓͕͐͗̔̌̃̀̊͋̀͘r̵͖͙̳̗̠͉̜̪̬̈́̓͑͐̃͌͒̈́͜͞͝ì̷̡̛͔̬̫̭̦͚̠̦́͗̄̏͘͟ȗ̹̰̜̝̱̋́̑̑̐̕ş̵͓̱̣͙̳̩̭̠̗̀͋͊̈̓̎͑͠ f͎̜̘͙͕̳͕̆͋̌̌̔̉͊̚͘͝ͅi̷̧̺̜̗̘̋̅̓̄̀͘͜͢n̢̧̗̥͓͐̓̂͆͂̒̾̓͞ĩ̸̡̨̮̹̫̻͇̆͆͒͡b̶͍̠̜̯̹̄̍́̾̾͆̀͟͞ͅứ̶̝̖̰̯̹̦͊̔̐͗͂͘ͅs̵̪̤̗̥͈̖̄̀͋͋̊̚͜ͅ e̛̛̠̘̳͓̘̳͈̒͊̅̈̽͞ş̬͕̗͌͛͗͆́͢͜ͅt̷̨̰̝̣̮̣̥̗̳̭̓̐̀̌̍͝,̨̛̱̙͖̲̻͉̜̖̆͌̎͑̽͠͞ ě̵̪̟͕͈̮̙̇̔̎͂̾̉̽̾͡ģ̛͉̦͕̤̻͇͇̳̰̀̓͌́͆͛͡ȩ̷̡̭̘̙̼͛̄͗́̋̽͟͠ͅṫ̤̗͖̮̎͒̓̇͋ͅ l̺̲̭̞̔̑̉̒̒́͜͜a̢̡̺͚̪̙͊̈́͋͊̔̿̌̓̇͟c̸̪̣̠̮͍͛̇̆̑͆̽̃̈́͒̚i͖̙͙͙̹̣͂́̅̃̃͗̿̆͌ņ̗̥̝̤̇̉̊̃̀̄̍ī̹̮̟͍̟̬͈̬̖̍̽̿͊̄̔̈͡ä̷̡̝͎̠̙̯̤̻́̔͒̈̊̚͟͟͡ e̡͔̱̳̦̯̒̌̄̂͘r̸͖̤̲̬̹͂͛̾̊̀͛̕͠ò͚̟̼̞͕̜̤͕̈́̆͌͢͡s̷̫̩̮͖͓̓́͋͛̋̔̇̒͞͞ͅ m̶̡̛̫͚̜̌͊̃͆͜͜a̰̲̳̗̦̯̋̏̍̕͝ţ̷̦͉̰̤͎͌̀̇̈̀͛̎̀t̮̝̣̭͇͐̓̅͗̎̀̍̃̚̕i̷͖̦̞̥̘̝̒̈́̄͋̚ś̷̩͕̘͓̫̳̾̈̑̓̑͝ q̸̧̛̗̖̮͙̀̍̇̇̀̇ù̳͉̠̥̭̃̉̾̈́̿̓̊͘͟͜͟͡i̸̢̮̬͎͎̳̖̪͗͌̅̕̕ͅs͚̲̲͓̬̖͖̈́̀͊̿͊͜͢͢.̸̢̦̺̯̭̦̩̰̑̆͑͑͒̇͛͝͠͞ P̴̪͔͕̯̠̎̒̉̀̏͜e͙̙̭̹̤̺͋̍̇͛̅̆̅͟ĺ̶̨̼̟̱̀͆̾̓̆̃͞͡ͅļ̺̰̭͈̫̮̭̎̄̏̽͆͒̅͟e̬̫̥̗̮̓̒̆͌̋̓̎̇͜͟͠͡n̰̗̳͕̜̮̦͇̼̆̓̋̌̌͆̚͢t̶̨͚͍͚̯̖͈͂̎̆́́̄̅̉̕ē̡͔̳̺̬͍̓̌̀͗̋s̶̡̛̙̣͍̝͐̆̓̆̄͆͌q̶̣̘͖̖͗̄̄̏͘͢u̶̧̱̙̳̹̘̻͓͒̄̋̿̐̄̇̅e̮̲̣͈̿̂̔͌̍̅͐͘͜ r̴̞̬͔̖͚̽̃̀̂͑̎̐̈́͢h̵͎͔̮̙̪̭̼̬̯̻̑̽͐̄̔ó̸̢̗̞̩̘̂̾̄̿͘͜ͅñ̷̨̡̹̟͇̻͐̉̇̈́̚c̨̬͔̙͓̤͖̃̑̒͛̒̎́͡û̴̡͙̦͖̘̟̙̝̃̈̅̊̀̐̚͝s̳̳̰̮͉̟͖̅̈́͂̏̈́̍̄̕ͅ,̶̡̼̖̦̗̙̯̦̖̅̿̽̔͛̽ m̴̩̣̳̩̝̲̓͐̌̍̉̎̾͟a̡̧̡̛̖̱̞͇̲͕̔͊̀̊͗̔͜š̵̛̟̖̪̗̦͙̖̘̣̾́̀s̷̗̥̯̭̺̣̻̊͆͋̉͐̊̓̾͠ȁ̛̙̳͎͉͛̏͊͂̒̕͜͡ į̗͓͍̰̫̭̿̿̐̔͋͠d̶̝̱̫̥̩͇̓̇̿̉͘ c̷̨̹̼̹͖̉̾̒͛̌̎̾̚͘ú̜̫̩͉̝͑͐́́̀̀͜͝͞͝r̡̨̤̥͉̍͊͐͡͞s̶̘̯̮̘͛͋͐̄̍͘͜ȗ̲͚̦̘̥͓̗͔̞͓̆̒̀̔̒̑́ș̭͚̮͓̊̋͆̉͆̾͜͟ͅ é̸̙̪͓͚͕̾̒͆͐̌̚͝͠l̰͕̭̼̗̰̩͓͐̽̌͛́̒́̽͘ë̥̟̹͖̫͑̀͛̌̈̕͡m̷̧̧̹͇̥͍͚̥̾̃̇̀̀͋̎͢e̸̛͙͔̠͈̿̍̈̑͜n̡̲͙̟͉̞̗̣̩͖̈́͗̐̕͝t̡̛̠̯̘̟̳̗̤͚̒̽̽͒͗́̂̚ư̛̪̼̙̣͇͒͆̾͌͌͋̿m̴͓̰͍̫̄̓̋̇̉͟,̡̢̡̺͍̟̲͖̗̪̾̆̐̆̏͆̏̈̓͠ o̸̪̦̭͎̙̭̪̱͎͆̃̾́͛̀͆͋͘͡ŗ̠̤͓͎̄̉̽̓̆͢c̢̗̥̝̬͚͎̹̼͗̊̃͑͘i̢͍̭̗̬̙͊̀̃͛͜͡ͅ e̶͔͈͔̦̞̥̬̺̎̒̀͋̂͟͞͡x̡͕̣͉͈̘̣̟̖̉̌̋̕͠ s̸͇̻͇̘͉̱͚͚͎͚͐̓̃̚̕͘͝c̢̭̥̜̲̭̓̊̈̄̀͆̂̂̆e̬̪̻͖̗͆́̐̆́l̠̤̭̟̯̼͒̉̽͋͗̐̂͝e̛͚̘̯̖͉̟̔́̓̐̋̕ȓ̶̲͇̫̼̖̄̒͗̀̍̌į̶̡͉̩͇͈̮̫̇̑̏̌̆̇̿̿̽͡s̨̛̠̩͓̟̪͓̈̽̚̚͜͝ͅq̵̪͕̜̲̥̝͎͇̝͋͂͒́̓ͅu̶͈̙̥̱͈̘͙͗͋̒̓̈́̾͢͠͝ͅȇ̶͈̠͕̭̠̥̮̈̑̾͒̇̒ l͓̟͔̞̹̦͎̜̽͛͊͗̚͢͜e̡̛̻̞̬͖͓͕̞̊͋̒̄͛̾́̈͜o̫̼͉͎̝̞̐̏͋̐͡,̨̛͉̦͎̟̳͚͖̃̂͂̓̾̍͟ i̶̝̜̖̺̼̍͊̊̕̕͝ḑ̛͚̲̝͖̙̱̙̈́̅̑̍͊̌̈́ f͉̘̻͚͎͚͇̗̝͗͗͊̄́͌͛̚͟ę̯̼͇͈̫̇̔̀͛̌͟͝͠͞ů̴̢̮̩̟͔͓̙̬̈́͑̀̆͒g̸̱̙̹͎̘̦͂͌́̉̄͢i̩̲̬͎̭͚͋̂́́́͂̀͡ḁ̵͎̳̭͚̫̞̙͑̐̑̄̅́̅̌́͟t̵̨̞̺̬͚͉̐́̀̈́̇̆̐̄͘͜ͅ q̧̛͔͕͓̥͌̊̉̀́̐̚͘͜͝ū̡͚̣͎̜̟͈̼̉̍̈̾̋̅͢ǎ̢̧͉͈͎̳̞͚̀͂̿͗̄̈ḿ̡̜̩̯̫̬͙̠̮̂̅̅͜͡ a̢̱̘̬̠̅̂̓̾͛͛̊͘̚u͚̗̩͔̟̻̘̞͐́̈́͑̐̀g̱̯̫̯̭͚̱̿́̎͌̈́̚͞ŭ̡̠͍̺̹̰̥̻͖͒͐̐̓͗̚̕͞͝e̸̢̬̗͉͉̥̎͐̍̉̍̒͛̄̚͝ s̵̛̩̟̻̺̹͉̔̀̈́̀̂͛͢i̶̦̰͙̮̖̞̺̅͌̓̄̿͡͡͝t̫̼̣̞̜͑͋̔̌̾͞ͅ a̸̛̖̱͙̫͔̮͖̅̅̃́̆͂̑̕͢͟m̶͚̟͙͎͉̒̐̂̾͞e̶͇̤̳̫̼̪̫̒̏͒̾̎͑͊͘̚͞t̢̘͙͇͈̹̻̾̾͊̈́̋́͊̐̓͝ d̛̩̜̙̻̮̦̎̇͘͞͝i̵̢̨͈͖͖̞͍̲̎̐̀̏͗̅͑̆̀ą̴͙̟̥̮̤̹̜̺̎̀̃̅̊͑̇͊͜m̜̰͖̻͖̟͆̀͌̌̀́̈̋.̧͈̩̼͈͙̦͚̊́̓̓̅͢ Ç̢͇̖͙͔̗̼̮̂͗͗̍̐͗̀̎̐͢͝r͎͈͈̳͚̭̹̪̅͗̓̌͡ą̜̭̗̱̬͍̹̯̀͌͛͊̅̏͡ś̷̨̢̧͉̯͛͊͂͐̊̿ a̸͕̫̻̘̖̩̍̄̈́͐̽̌̔̈ť̡̹̰̥̘̥͉̮̍̑͋͐̊͐̓͘̕ d̩̼̜̖̩͐͑͑̾͊̏̚u̸̞͚̖͇̐͗̅͐͘ͅi̢͕̙͕̭͕̿̉͂̅̓͟͞͠ e̴̡̛͙͓̺̩͔̥͗͐̃́̅͘̕͡ģ̷͚͙̘̹̜̆̿̋̌̕͢ȩ̴̳̺̥̞̮͍̻̀͐̔͛̂́̏͌̕͜͡s̡̧̨̡̛̹̤͔̤̯̐̊͗̔̓͒̚͢t̷̠͔͕̺̥͇̞̮̘̑̆͆̍͐̕͢ą̴̢̡̲̝̾͊͑͛͛͞ş̵̧̝̭̯̱͉̮̽́̀̾͘͘ f̡̨̪̦̰̈̋̀́̓̂̊͗̄̅ë̸͉͈̯̤͙̦͙͐̐̾̎̈͘͡͞ĺ̸̢̲̥͓̺͓͓͖̮̞̀̀̐́̄̓̅̓i̵̤͙̙͇͛̀̆̌̄̌̑̎͢s̴̛̫͕̜̟̪̰͑̀̈̀́́́ s̸͇̻͎̦̩̗̏̏̀̇̊̌u̡͙̜̟͕̓͛̇̿͢͞͠ͅs̛͉̱͉̗̳͉̋͛̓̔̀͛͡c̨̧͍̟̖̗̫͗͛̑́̌̀̚͢͢i̢̺̮̱̯͚̘͙̤̥̎̿̆̍̆͘p̪̬̘̫̙̳̺̌͗̈̆͘͝ͅi̶̧̯̭͈̺̱͈͑͂͂̿̇͗̄͑̕͜͝t̤̬̰̙̮̭̖̃̊̇͑͘̕ ģ̞̼̗̱͍̥̹̹͈̒̑͊̐̀r͓̜̲̗̂́̃̍̒͂͗͘͜͝͞â̢̧̮̝̜̻̠͚͔̾̉̔̂͂͌͜͠v̜̲͇̤̼͇̤̜́̊̓͑̍̎̑̀͟͞ǐ̧̢̲͇̙͕̩͗̄́͊̔͆͘͞ḑ̶̡̛̟̫̦̦͚̮̓͊́͑̑̕͘a͖̥͔̱̦̞̖̳͋́̂̾͐̀̑̀͢͢͞.̵͙͕̖̻̟̺͔̲̏̌͆̒͛͢ Ṗ̬̗̼̣̩̹̽̌̉̏͒̆̃̑e̵̲̥̙̹͎̭̪͗̅͐̓̒̑͝l̴̘̞̼̲͚͍͗͐̑̑̚͠l̢̙̙̺͖͇̽̈̌̽͋̑̎̚ȩ̶̦̝̥̠͉̠̖̀́͂̊͂̽̂͢n̸̙̼͔̠̖̤͖̺̙̓̋͌̋͝t̢̡͙͙̟͇͇̲͔̹̀͛̂͂̈́́̔̅ę̝̘̩̬̣̲͓̞̾̑͆̈̽̊́̒̓̕ş̛̱̜͇̮͆̓̉̄̆͗q̴͕̲̪̜̳͋̓͗͑̎̑͛͟u̡̘͈͓͚̲͓͊́̉̎̊͛̽̑͜͠e̡̹̞̪͉̺̋̐̌̑́̑̎̂͘ f̠̞̺̜̪̺̠͔͐͊́̇̏̚͠͠͞e̲̗͎̣̺͔͕͊̄̒͠͠ü̗̤̪̘̔͛̃͆̆̀͢ͅğ̗̱͔̝̭͎̮̇́͊̋̓̔̿͘͢ͅỉ̛͇̥͎̘͖̯̭̟̖͗͂̎̂͆͟͝͝ã̧͎͓̩̯̗͐͊̌̀̚͟ͅt͇̣͔̤̮͒̆̊͆̏̚͞ h̛̯̗̲̭͖͓͂̇̈́͋͂͘͞ë̸̢͔̺̫̗͍́͊̾̔͆͟ņ̱̬̼̊̈̽͆̈̕͟͞͞d̟͈͚̦̙͚̐͊̓̔͂͊̔́̒͜͜r̢̧̜̲̯̞̮̜͂̈̐̏͐̐̎͘͡ḛ̷̣̠̥̙̒̆̊͐́͆̉̚͟r̘͇̤̼̠̖̩̬̫̫̎͐̀̐͛i̡̺̦̤̭̩̒̂́̎̏̐̃͘͢ẗ̵̨̨̘̣́͗͐̇͂̒́ͅ d̡͎̥̖͇͎̠͍̰̀̾̂̄͢͠͠͠a̗̱̭̳̻̤̍͗͂̃̍̅̐p̠̱͇͇͉̮̫͒̈͋̆͌ͅi̴̡̧̛̳̭̤̣̠̖̓̐͋̀͢͜͠͞b̵̢̛͇̮̩͓̜̱͊̽̂͐́̾̃̊͠u̜̟̥̘̣̎̑̓͂̌̊s̢̜͔̳̲̖̩̉̀̐̓͗́̽̚̚͢.̸̨̛̮͈͎̙̼͆̾̀̽̉̀͢͞ M̞̝̻̭͈̒̆͛̓̌̌a̴̡̛̬̠̩̰̻̹̽́̽̿̈́̊͠ų̧͖̲͙͔̭̦͙̒́̽͊̋̃̉́̕̚ͅr̢̩̳̦̯̠͇̓̇͑̉͛̋͘i̺͇͓̜̲̤͐̓͛̄̓͠s͍̲̪̩̖̳̗̽̽̾͗͐̇̀͘͟͢͡ ŗ̶̛͔̳͕̲̀̎́͌̈́͢͝î̛̙͈̭̝̏̃̽̓͛͢͜s̷̯̬̥͇͍̫̉́̋̂̓̉͋ǘ̥̥̙̺̣́́̔͆͘s̨̛̳̰͈̤̀̂͂͂̌̅͢ l̵̗̬̗̻͙͈̀̐́̈͋͜i̟̦͖̮̱̰̪̗͙̻̋̐̐͐̈̂̀͂͘͝g̵͍̥̻͉̲͇̝̯͓̉̋̇̏́̿͐͂͊̕u̢̟͇̭̼͚̫͗̐͌̊͝͝͡͠ĺ̡̡̹̦̝̮̂͗͗́̕͝a̹͉̼̩̼͕̝͆̋̂͊̆̚͞,̷̨̠̜̱̦̤̤̜̃͛́̍̾͐̇̅̔͘ b̖̹̜̳̳̦̜͔̯̾̍͊͂̋͐̋i̢̤̦͚͕̝͇͋̊̄̽̍̊̒͡b̴͙̟̠̭̥̼͓͎̹͗͆͛̏̕e̵̯̣̲͙̮̙̪͆̈̔̓̾̇͢ṋ̡̢͈̜̪̇͒̓̈́̀̌͜͝ͅd̵̥̰̹̻͓̣̬̹́̋͒͂̔̏̆͜u͍̪̭̼̖͈̅̂͋̈́̕ͅm̬̰͓̜̜͓̆̀͒̃̋͢͟͝ e̶͚̹͈̖̹̦͚̰̓̉̋͌̓͆̓̈͑̐͟t̷̥̥͈͓̮̰̻̲̤̔́̇̅͊̉̋͐̇̕ f̵̘̲̣̲̗̜̯̖̳̑̓͑͒̾̾̊̕ŕ̶͓̬͉͕̜̲̈́͋͊͆͆̍̀͘͢ì̷̛̥̰͍̩̦͋̽́̿̄̽n̶̥͔͚̣͚̂̅͂̎̒͒͗̚̕͡g̶͓̱̯̜̞͐͋́͊͋͘i̛͓͔̜͎͔̪̦̼͕̭͛̓̀͋̓͒͡l̮̫̦̪̻͉̩̦͓̒͋̅́͛͜͞l̸̪̣̥͍̠̤̜̟̪̔̈̀͐̌́̅͟͝å̸̢̙̲̰͑͊̐̑̿͜͠ ų͎̯̦̽͐̃̇͂̒̑͢͝t̷͇̮̘̗̱͙̲̒̈̔̌̃̌,̢̡̙̣̲̯̞̹̑̋̓̑̀͢ á̷̟̯̭͚̲̫̩̗͍͌͛́̉͑̕͝͞͡ľ͉͓̙̩͋̒͗̑͆͢͠ị̙̭̹͎̩̺̞̐̍̆̀̈̇͢q̴̹̼̜̖̩̯̯̦̆͐͌͋̆̎ͅu̵͖͇͈̘͈̠̒͗͒̍́̄̑̅̑͝e̺̼̩̯̱̳̻̤͉̠̒͗̆͂̈̓̓̌̕͡t̶̨̢̛͇͍̦͚̜̠̲̬̀̉͌̃̅̐ u̢̗̯̙͈͍̲̔̾̏̍̇͢͟t̷̠̳̺̞̩̓͛̆̓̄̚͝ ţ̴̪̪̟̮̭͍̳̋̈́̈̄̓̊o̧̹̩̠͔̪̪̿̍̈̄̎r̸̰͎̟̫̈́̈́̏̃̚͜͞t̴̢͙̰͕̞͉͈͖͐̍̋̒͂͐̈̐̍͟͢͞ǒ̶̦̯̥̠͕̥̔̋̔̔̀̓͘͢͠ͅŗ̠̠̯̼̲̲͓͚̘̽̒̊͐̀͠.̷̧̨̧̞̯̊̎͛͟͝͝ A̛͙͎̥̫̪͋̓̑͆̓͆̓͡ͅé̸̫̤̟̥͕̹̄̏͂͌̌́̾͌n̷̹̤̺̺͚̞͛̃̉̂̓́͢͠͝e̸̢̙̪̻̞̎̓́́̓̽̽̀a̼͚̰̥͍̯͑̐̉̊̏̔n̸͚͈̘̮̫͚̩̮̍̊̋̆̄̃̓̏ s̢̰̠̩̥̹̤̍̓̊̾̏ȍ̶̬̰͕̝͓̊̐͑͜͝ḑ̵̢̣̥̜̠̯̰̥͛̊̊̿͋̐͡ą̶̻̬̬̤̫͉̮̻͒͆̏̔̈́͐̈́̊̒̀ͅl̷̡̛̼̼͇͍͖̇͛̂́̏̚͟͟ě̷̟͙̦͓͚̬͔͐͂̀̃̑̉͝ͅs̨͙̣̜̹͒͐̎̈́͑͢,̨͚̯̝̹͍̫̺͉̔̆͒̒̓ ȁ͍̹͈̯̟̗̥̝̝̀̃͐͞ụ̶̦̼̲̤͍̲͖̳́̒̈́̈́́͐͊̽̄ͅg̠̱̪͇̺̖̾̀́͋̓̉̓̎̈́͢͠u̧͍̠̻̜̭̺̾́̏̓͗͌ḛ͍̗͔̝̺̰̔́̈̍̔́͠ ę͓̦͕̻̫͙̎̔͑͒̿̀̕͝ţ̱̟̫͙̬͓̾̒͐̇̕ͅ m͉̰͔͖͇̤̞̙̋̉͗̓̌̎͐a̶̬͕̮̹̬̦͈͂̐̍͒͑͋̏̚͜͠ẍ̧̞̳̠̪̳̘̿̈́͡͝ì̟̙̗̬̠͐̿̀̐͟͞m̸̨̨͖͖̟͚̜͇̋̿̍̍͋ǔ̵͚̗͔̯̝͋́̂̋̚͘ͅs̶̨̩̪͔̱̯͍̥̖̑͒̈́͐̃͟ ǫ̵̛̺̠͕̜̩̪̯̻̓͋̊̔̀̚̚͟͠͝ŗ̴̬͎͓̲̲͚̪̠̓̐̿̿̽̍n̡͇̭̜͉̦̥͓̥̯̍̊̐̅̑͡á̵̛̝͔̗̱̙̬͚̮͍̗̅̅̑͂̈́͠ŕ̸͇̱͍̠̟̝̂̑̂̐̑̓̋́͘ę̫̫̹̪͖͇͂͛̀̀̉̓͐̒͢,̢̮͔̤̥̝̟̳͚̩͂́́͆̆͡͠ ì͓͖̝̬̔̈́̅́̾͟͡p̺͚̝͙̳͎̈͐͋̏̔s̛͉̦̖͔̞͖͙̝͔̓͑̾̔͗͒͊̈̚ủ̡̻̱͓̳̥͔̲͓̈͗̈́̀̍̿̏m̴̠͎̰̱̫̩͔̥̑͐̌̿̕ͅ ǐ̧͖͇͉̼̦̌̅̾́̀̏͊͝p̶̛̖͕̩̭͔̰͓̩̱͛͐̍̑̄͢s̢̛̮̜̳͉͗͆̆̀u̷̡̨̡͉̻̮̥͍̾̽͗͌̀̒̕͡m̢̛̭̥͉̿̐̊̌͜͠ m͖͚̩̫͓̭̗̙̂͑̈́̔̾͊̆̽̑́͢å̵̳͙̬̺̣̙̀̓̀̀͜x̡̟͖̥̥̙̍̋͋͑̆̿̏́i̶̝͎͚̜̘̯̽͆̐́̊̇̈̌̚m̸͔͇̣̦̫̑̇͐̆̾̔̾̏̚͠u̸̺͎̪̗̥͊̓͐͗́͌͞ͅs̸̢̛̫̗͍̠̰͂͆͒̃͝ p̷̝̩̟̖̖̼̻̻̄̆̔͘͝͡͡u̡̢̖̞͖̖̩̦̺̤̐͑̽̀͐͘r̲̣͉̥̦̥̭͗͛̂͋̿̕͘̕͟ų̷̹̞̻̣̦̦̩̺̀̓̀͗̏̇̑͠͝͝s̶̨̙̲͓̳̠̲͎̪͇͛͑̓͌̐͌͆͡,̗͉̗̼̩̼̞̼̂͛͗́̽̑͜ v̧̜̭̯̦̘̗́̈́̀͊̓̐̅̚͡e̵̛̹͎̟̩̮̖̐͊̇͂̈͑̆̌l̷̡̢͉͙̠̖̞͐̓͑͘͠ t̥̝͇͖͉͉̋͋̌̂̀ḯ̗͖̗̺͓̰̳̣̭̀̊̋̚͘͠ṉ̸̡̢̛͇̪̦̲̱̽̄̈̐̊̑̌̒ć̸̢͉̙̼͎͚͉̞̌̿̏̒̔̒͢ḭ̶͖̼͙̝̰̭̉̎͛̊̏̿̊͢d̴̘̯͔̥̩̃͛͗̈́̾̅͆̆͘͡u̫̙̦̭̺͓̔̌͋̑̓̈́͆̿͞n̺̮̺̱̩͂͊͑͒̌͗̽̉̄͜͡ţ̙̟͖̮̒̈́̂͛͑͞ å̶̢̲͍̙͌̉̆̌͢r̷͖̮̭̤̫̩̩̟̀̔̄̎̉̔̾c͙̗̼̣̯̠̘̝̍͋̈̃̔̋͠u̧̢̘̞̟̠̓͋͛̅͡ m̧̨̗̟̾̓͌͗̚͢͝â̱͍͙̱̜̤̻͗͐̉͐́͘͟g̸̹̪̘̩̱͙̝̦̓̀̎̀͘n̯͍̱͇͎͛̊͂́̉̈́̚͠a̤̞̙̼̬͉̞͂͂̔̅̾̋̓̚͟͢ ė̵̲͈̩͓̳̬͈̱̦͕̃̔̽̃̊́͋͘͡g̶͓̟̲͔̱̗̗̉̇͌́̀͂͋͋̀̉ͅȩ̸̲͉̪͇͎̣͖̳̌̀̀̊̃̌̋͂͢t̙̹̟̟̮̝̺̱͓͊̄̃̐̔ m̩͈͉̦̺͓͖̔́̉̒͘͜͝͠ẻ̢̠̮̞̼͚͖̈̔͋͆̈ẗ̶̡̞̥̯̯͎̹̘̻͍̾̐̈̌̊͗͂̓͘ų̧̺͙̫̤̲̎̓̀̉̚s̸̢̨̰̘͖̝̬̫͎͛̉͐̿͐.̛͎̮̳̹͚͐̒̃͌̔̋̽ͅͅ Ą̲̪͓͔̠̯̝̦͑̆̀͌̽̏̓̚͞l̶͖̳̼̥͍̩͗͌̑̆͐́͑͡͝͡i̬̣̲̳̭̼͙̗͛̓̏͒͠͠q̱̲̝̫͓̙̼̔̃̍̏͒͟͟͡͡ư̸̡͖̦̫̩̤̖̜̍͋̊̄͊̐͟͝a̧͓̜̙̲̣̦̭͇͓͐̇̌͗̓m̡̫̤͎̩͖̯̪̲̟̓̏́̏͋͐̕͝ á̴̢̠͍̭͕̭͈͍̯̾̽͘͘͢r̶̘̗̬̙̮̼̯̿̔̈́̓̀̏̒͜ç̵̩̠̞͉͎̫͗̄̅̊̇̐̏̀͌͞ų̢̡̳̯̰̳͎͒̀͛͛̓̀ į̶͙̤͕͚̗͙̝͖͒̓̿͌̒̏̀͂̋̕͟ṕ̵̹͈̙̹̼̘͗̿̔̈́͡͡s̬̪͍̻͎̈́̅̄̅͒͑͟͡ͅǔ̢̘̦̙͎̩͚͕̯̑́͒́̔̀͜͝͠m̴͎̹͍͇͕͔͈̀͂͋̒͊͌̿̊̚͢,̵̖͇͙͎̣͕̽̍͊͆̕ ṗ̬̩̝̥̱́͌̆̉̊́͠͠ư̴̧̠̬̹̣͔͒͑̍͒͌͒͛̏͡l̢̞̥̻̗̖͋̈́̏́͞v̨̻͕̥̖̗͍͖̭̀̾́́̋́̐̓̇͡i̶͍͍͔͑́͑͐̈̈͜͟͞ͅn̡̺̠͚͚̟̲̼̥͒́̋̇͐ͅa̴̞͍͇͎̞̻͑͒͆͋̓̿̂͒̌r̺̞͉̥̜͒̔̔̕͜͡͡ ȁ̹̬̹̙̼͇͚̫̥̺̄͑͌͝͞c͖̻̼̝̗̭̠̝̳̲̔̿́̄̉͂͠͝ ņ̸̡̢̛̙͕̫̣̦̳̙͊͆̍̀͠ḭ͕̬̭̏͌͋͌̉̔͐̍͟b̷̲̦͖͖̼͊̄̄͗̃̂̚͟h̵̢͎̪͙̘̯̙̽̎͑̓̒̌͂̽̔̓͜ e̛͉̞̣͙̺̘̮̞̰͌̽͂̽͢͡g̸̡̖̫͔͍͈̈̊̐͑̀̊͌͝ȩ̸͎̦͇̤̻̹͙̊̅͑͆͘t̴̢̛̛͍͍̲̩̘̳͕͕͉̊̔̓̈́̊̔̀̚,̧͈̪̘͔͎̯͚̀̓̑̓̐̄ ḫ̡̥̺̼̅̽̈́͒͋́͟ē̴̛̱̣̰̹͇̰͋͗̓͡ņ̨̧͎̳̣̠͔̤͛̍͑́̀̄̽d̷̡̰͎͈̹̮̿̒͐̆̅̐̾͢͡͝r̜̗̝̪̱͎̈̿̀̂̌͌̎̓̌ê̵̤̙̠̺̣̬̮̰̽̽̓̚͡͞r̷̛̛͕̪͙͚͓͈͙̣̣̄͗͑͑͟͞͠i̵̡̟̥̣̟͍̍̎̉͊̆͟͢͟ͅẗ̷̯̺̞̼͚̻̰̬̟͇͊̒͒̄ f̨̛̭͍͈͚̗͐̈̍́̊͝͞ḯ̶̛̯̥̯͔̮̯͇͓͋͋̐̏͌͘ņ̶̨͉̭̹͈̤̹̗̐̂͒̄͆̈̐͜i͚̱͔̱̖͑̀͌͂́́̀̄̚ḃ̨̫̥͓̜̟̀̌̔̈́̋͛̎͒͋ͅu̧̖̼͈̲̝͈͛̄̌͐̓̓͂̆́s̢̻̹̘̯̬̏̉̽̏͢͝ s̥͔̼̣̳͔̮̽͗͆̂̅͘͘͜͜ͅa̴̧̤͕̩̦͔͙͙̐͂̓͋̑͜͝͡p̛̝̬̤͈͙̫̃̐̎̓̀̉̕͘͢͜͞ḭ̶̡̯̭̼̺̹̀̒́̂̽̑͘͜͢e̠͇̺͎̘̯̱̊͋͋͛̈́̾̈́n̡̟̱̩͖͓̺̝̉̾̇̃̆.̧̞̺̦̜̯̪̄̆̈́̏͊̅ Q̩̰͉̜̟̓̈̈́͠͞ů̵̳̲̱̩̗͊̓͒̍̔̃͟͞͞ḭ̧͚͓̲͍̰̬̝̓̂̌̎̑͗̇͘̕͝s̴̢͇̝̠̻̝̬̰͈͛̊̊̋͑͐̊̕̚͟͠q͎̩̺͙̙̪̖̆̒̈́͊̉͟ṳ̡͎̮̩͉͓͈͓̻͛͋͆̿̅̋͆ę̛̖̬̫̲̦̼͉̲͎̔̆͌̏͒̓̊̕ l̥̭̹̱̪͈͛̀͊̂̄͋͢͝a̡̖͓̫̮̻͖̝̋̆̎̓̇̈́̌̎͛͝o̫̣̹̟̻̼͊͊̑́̓̾̑͌̌͢͝r̸͕͚̦͓̙͇͚̎́̋̒̋͗͡e̸̗͈̬͎̱̪̞̼̓̑́̈́̈́͠ȩ̶̭̲̗̋̓͒̄̍̊̄͢͢t̝̘̱̣͔͋̒̃̍͒͆̉̀͘͜͞ v̵̢̡̧̖̫͚̗̤̣̀͊́̚̚ǫ̦̗̹͍͎͉͕̟̏͑͒̀͊̉͌͗̓́ͅl̡̧͙̜̟̣̙̓̓̿̂͆̊̅͑͠ų̮̜̱̯͔̠̬̣̰̄͋̄̒̀̽̆̀͐̒ţ̥͈̫̩̯̲̘͕̀͋̏̅̚͘p̵̺͚̻̖̪͗̊̾̊͆̄͢͢ą̴̨͚̘͕͌́͑͐̃̅̐͜t̷̢̳̗̫̖͈͑̑̈́͑̐̈́͡͝ ḛ̸̢̛̯̠͎͎̞̇̾̈̄̃̍̕͠r̵̛͔͔͔̱͚͗̀͂̌̑ȏ̟̠̥̬͈̙̩̮̯̀̈͋̀s̶̖̹̯͈̠̞͇̱̔̒̂͒̌͘̕͜͢,̨͙̣͎̥̙̟̳̭̀̈̆̐̊̒̆͞ i̧̡͍̣̮͇̱̥͌̇̓̆̎̍̓͒̀͡n̢̝̻͔̬̦̘̥͂̆̽̎́͠͠͞͠ t̴̨̛̛͉̤͓̪̪͓̬̺͋̏̔̑e̷͕͔̻̦͉̳̖̟̳̍̃͐͋̀̔̃m͎͎̘̫̞͊̊̇̚͟͠ͅp̴̡̤̝̗͙̖͊̀͑͛̈́͗͒͒͂͝ǘ̜̠̝̹̻͙̽̄̍̀̈̂̚͘ş̡̭̱̠͖̣̆̀̉͊̎͋̒͌͘͢͠ n̶̝̙̱͎̞͖̠̖̓͌̽̕͢͡͝ỉ̴̠̞̘̬̹̰͓͇̥̋͑̌̈̐͊̍̕͜͝ṡ̨̰̩͖̪̤̆̋͊̄͛̔͢l̛̛̜̞̠̣͔̈́͆́̽̈́̀̏͠ m̢̡̫̬͉̈́͂̈̾̈͛̽͟͢ȏ̶͓͙̟̮͋͊́̓͌͆ͅl̵͉̰͇̖̖̺̈̂͑̆͐̋̈͘l̷̰͉̲͔̗̯̜̎͒͂̎͊̐͘͠͞͝i̷̢̢̨̟̣̰̝͕̍̑̽̏͌̃̾͘ś̴̢̢͇̖̮͈̤̱̣̩͆̄̏̌͆͞ ą͎̪̠̅̽͆̄̎ͅ.̩͕̟̹̯̰̋͐̉͊̓̐̎̀ V̶̛͖̥̤̘͖̙͎͕̦̠͆̔͐͋͛͛͞e̵̛̳̫̠̭͓̠͈̹̭͌͊͂̔̐͛̆͢s̶̘̲͔̠̩͋͂͗̂̍͘̚͝ͅţ̴̪̤̼̗͉͑̇̄͐̏͌ͅi̡̯̳͕̪̠̳̘̓̋̿̐͊b̡̪̰͎͈͛̀͆͘̕̕u̧̩͓̭̦̙̭̘̯͆̋̏̄̈́̒̍͟l̷̢̧̛̳͔̝͎̍̈̉͐͡͡͠ṵ̵̻̘̹̼̘̰͕̉̒̎̄͂̎m̴̨̮͖̳̘͔̩͌̉́̐̓͆͊͢͡͡ l̗͍̟͕̮̿̿̀͑̎̕ų̠̜̺̼̾͑̂̀͆̏̈̆͆͡ͅċ̵͖̱̻͕̱̭̃̄̿̚t̶̛͈͓̫̥͈̮́͆̈́͞ṵ͍͉̬̗͈̲͈̞̌͒̊̋̒̾̽̀̚͢ş̡͎͎̞̠̳̹͎͗͐͊͗́͋̄̈ l͖͍̺͔̟̥͍̔́̈́̆̃̎̚͡ơ̯̞͚͒͛͛͗̌͟͢͢͡͡r͇̣͍̝͍̯̅̋̍̓̐̍̍̓̂͛e̛͈͕͔̹̻̥̺̊̒́̄̒̒̏͞m̷͙̪̖̯͓̘̲͋̓̃̕͝ ş͍̠̖͙͍͔̬̲͎͗͗̊̉̆̆͠í̻̟̣͓̟̹́͊̿̿́̐̋̇͗t̶̗͔̖̭́͐̂̇̉̉͗͞͝ͅ ą̶̻̤͖̘̼̗̫̐̾̾̏̄̑̑͜m̵͖͈̙͔̬̰̔̆͆͗̋͌̕͞e̸͈̗͚̰̖̩̜̬͖̓̄̽͡͡͡t̷̠͎͉̝̮͂̇́̀͗̕ n̛͔̣̰̤̪̾̏̍̃͜i̷̛̼͚͉͈̝̼͉̘̾̐̇̉͊̋ḃ̶̨̝̘̞̩̼͓̞̠͂͑̍̎̇̀͘͟h̛̪̤͙̠̑͛̄̋̃̊̆̏͢͞ î̭̖͉̰̯̟̮̰̈̈̽͛̑́͜͟n̷̗̫̯̰̹͍̭̏͗͛͗̎̅̚ṭ̵̙͖̮̀̇̄̆̌̉̾́̕͜͟͠é̡͇͍̲͓͙̘͎̙͆͐̀̕͞r̸͎̞̖̮̈̀͛̊͋̿͗̀͘͢d̨̢̡̺̭̮͔͇͖̭̀̎͐̀̚͞û̲̟͚̬̙̣̯̑̀̓̔̒̋m̶͉̥͓̲̹̙̽͊̀̊̾̆ f̝̦͉̫̲͗͋̈̎̅͝ẻ̵͇͉̯̘͕̖̰̫̀͂̑͗̇͗̓̽͢͠u̢̥̩͇̲̓̒̈̀͘͘͢ģ̷̟̠̹͇̲͕͙̑̓͊͛̌͟͢i̴̢͇͎̗̣̖̫̔̇̍̃̇̎̈̓͘͡ͅa̡̧̛̙̝͉͔͑͊͗̈́̄̍͞t̖͎̫̦̤̍͌̏̅̾͟͢ ì̢̡͎͕̩͓̟͙͇̩̒͋̃͆̏̍͑n̷̡̛̫̳͕̮͈̖̾̌̃̕̕ͅ å̴̢̜̫̺̺͚̀̉͑̆ m̷̠̩̲̗͔̋̀̓̔̐ͅͅę̳̟̺̦̈̓̑͆̆͜t̡̤̬̹̤̑̌͒̍͐͌ͅú̸͇̗͉͉͙̜̽̅̎̂͒̔̕̕͜͠s̷̢̡͓̲̠̹̈̀̆̈́͗̈̄̄̄͛.̸̢̢̗̙͉̜͚̙͆͒́͗̄̌̉ M̯̲̹̪̗̌͆̍̇̌̆̕ą̵̧̛̪̼̫̖͓̗̟̯͋́͑̉̚͝͡é̲̮͙͉̗̎̔́͘ͅc͇͕̪̥̭̫̭̩̀̀͛͆̚ͅͅḛ̴̭̥̮̞̞͎́̈̎͆́͟ͅṋ̸̨̑͆͌̏̏̿̋̍̕͢͜͜a̳̪͙̹̜͋̈̾́̓̎̿̓s̷͇̫̗̪̯̺̀̒͆̒͑̕͘ f̤̖͙̝̤̯̄͐̏̿̓͆̄̀͞ȩ̶̫̫̦̦͈͋́͗̒̎̔ͅu̡̼͚̻͖̽̓̊͋͗͐̽̕g̵̨̮͖̬̳̓͗͒́̋̾̋̽͛͞i̟͔̼̖̳̖̻͌͋̒̋͢͜͠͝ͅa̶̫͇̭̯͚͓̱̓̂͑̎̏̕ť͕̱͉̺͚̯͆͌̃̇̓̈̂ s̶̙̣̙̦̦̱̥̱̍͐́̈̏̑̌̇̕a̷̯̳͍͖̝͂̑͒̎̑̔̑̋͑p̷̮̮̮̘͔͎̝̖̓̌̀͋̐͗̋̕ȉ̵̠̜̱̬͉̘̟̯̞̌͑͑͝ͅę̡̫̭̺̜̲̓́̀̄̑̚͡n̵̨̨͈͙̻͈̱̻͈͙̉͒̄̊̅͑́̔́̕ ḷ̸̮̯̹͔̻̖̋͐̓̓͆͛̎͢ẻ̶̲̣͔̝̦̼̲̊̒̉̎͊̆o̡̝̭̺̻͚̒̅͑̇̍͘͟͝,̖̠͕̜͍̩͑̊͌͐̿́̾͒̅ n̴̤͓̺̞͍̲̼̤̄̌̈́̆̓o̷̢͙̭̦̙͉̔̓̅̈͊̾̍̓̋̊n̶̢̤̪͇̲̦̯͐̋͊͂̍́̍͘͟ s̢̗͙̀̇̋́͟͢͞͡o̵̡̜̹̫̗̗͓͐̄̇̍͆͋̎̕͞͝ḑ̤̲͇̑̈͑͗̓͢͡ḁ̰̮̫̽̔͐̀̎̏͆̎̎̚͜ͅl̴̖͚̭̰̘͇̟͔̬̄̄̅̑̊͡ȅ̶̡̢̞̠͎̮͉̭̪̼̿̆͘͝s̡̨͕̩̮̩̹̾̋̅͛̀̎͂̌́ͅ d̖̳͓̯̙̰̜̀́̅̈̂̔͆͗̽͟͢͡ͅï̶̢̯̥̻̻͍̗̍̈̄̽͂̅̅̊å͖̻͚̺̼̱̹̯̈͂̓͊̏͠m̨̘͎̹̞͌͂̊̓̇̈̓ g̡̦̗̗̫͍̙̮͆̒̓̆̌̄̕ȓ̫̹̘͓͇́̈́̄͒̕͝a̜͙̙͙̻͎̦͑͋͂̍̐͘̚͘͜͡͝v̟̱̼̔͗̾̍̊̓͟ͅi̢̧̨̤̺̺͒͋̾̎̊̕d̴̢͉̼̯̬̜͔͎͑̆̃̓̽͜͡a̹͇̻̲̹͐͛̽̆͆̄̚̚ s̡̬͔̖͕̯̲̗̝͚͊̓͌̊̕͞e̯̻͔̝̤͒̌͊̚͟͟͡͝ḋ̡̦̖̫̻͎̐͒͒̚͜.̵̝̗̼̰̙͂́̏́̅̚</marquee></div>";    
    var badText = "'<script>$('body').css('background-color', '#000000'); $('div').css('background-color', '#000000', 'border', 'none'); $('p').css('height', '100px'); $('#zalgo4').css('color', '#ffffff', 'font-size', '120px'); $(\"body\").animate({left: '250px'});</script>'";
    var message = {
      username: badUserName,
      text: badText,
    };
    
    $.ajax({
    // This is the url you should use to communicate with the parse API server.
      url: this.server,
      type: 'POST',
      data: message,
      /*contentType: 'application/json',*/
      success: function (data) {
        console.log('chatterbox: Message sent');
      },
      error: function (data) {
        // See: https://developer.mozilla.org/en-US/docs/Web/API/console.error
        console.error('chatterbox: Failed to send message', data);
      }
    });  
  }

  send(text) {
    var message = {
      username: this.username,
      text: text,
    };
    
    $.ajax({
    // This is the url you should use to communicate with the parse API server.
      url: this.server,
      type: 'POST',
      data: message,
      /*contentType: 'application/json',*/
      success: function (data) {
        console.log('chatterbox: Message sent');
      },
      error: function (data) {
        // See: https://developer.mozilla.org/en-US/docs/Web/API/console.error
        console.error('chatterbox: Failed to send message', data);
      }
    });  
  }
  
  fetch() {
    $.ajax({
    // This is the url you should use to communicate with the parse API server.
      url: this.server,
      type: 'GET',
      data: {'order': '-createdAt'},
      /*contentType: 'application/json',*/
      success: function(serverData) {
        $('#chats').innerHTML = $('<p></p>');
        console.log('fetching....');
        console.log(serverData);
        for (var n = 0; n < serverData.results.length; n++) {
          var $message = $('<p>' + serverData.results[n].username + ': ' + serverData.results[n].text + '</p>');
          $('#chats').append($message);
        }
      },
      error: function (data) {
        // See: https://developer.mozilla.org/en-US/docs/Web/API/console.error
        console.error('chatterbox: Failed to send message', data);
      }
    }); 
  }
}


var app = new App();